'''
23811. 골뱅이 찍기 - ㅌ

첫째 줄에 정수 N(1 ≤ N ≤ 100)이 주어진다.
셀의 크기가 N인 골뱅이를 출력한다.

1
@@@@@
@
@@@@@
@
@@@@@

3
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@
@@@
@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@
@@@
@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@
'''


# 'ㅌ'의 긴 부분을 출력하는 함수 long
def long(num):
    # 총 num 개의 행을 출력하되
    for _ in range(num):
        # 각 행에는 num*5개의 골뱅이를 출력
        for _ in range(num):
            print('@@@@@', end='')
        print()


# 'ㅌ'의 짧은 부분을 출력하는 함수 short
def short(num):
    # 총 num 개의 행을 출력하되
    for _ in range(num):
        # 각 행에는 num 개의 골뱅이를 출력
        for _ in range(num):
            print('@', end='')
        print()


# N을 입력 받고
N = int(input())
# 긴짧긴짧긴 순으로 'ㅌ' 모양을 출력
long(N)
short(N)
long(N)
short(N)
long(N)
